app/controllers/reports_controller.rb

SELECT  "reports".* FROM "reports" WHERE "reports"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new_comment
    report = Report.find_by(id: params[:reportId])

SELECT  "reports".* FROM "reports" WHERE "reports"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_report
    @report = Report.find_by(id: params[:id])